[
    {"input_text": "You are in a dark room. There is a door to the north.", "target_text": "go north"},
    {"input_text": "You are standing in a forest. There is a path to the east and west.", "target_text": "go east"},
    {"input_text": "You are at a crossroads. You can go north, south, east, or west.", "target_text": "go south"},
    {"input_text": "You are in a kitchen. There is a table with a loaf of bread on it.", "target_text": "take bread"},
    {"input_text": "You are in a library. There is a bookshelf filled with books.", "target_text": "read book"},
    {"input_text": "You are in a dimly lit cave. There is a tunnel to the right.", "target_text": "go right"},
    {"input_text": "You are on a beach. The ocean is to the west and a forest is to the east.", "target_text": "go east"},
    {"input_text": "You are in a small village. There is a market to the south.", "target_text": "go south"},
    {"input_text": "You are in a haunted house. There is a staircase leading up.", "target_text": "go up"},
    {"input_text": "You are in a spaceship. The control panel is in front of you.", "target_text": "press button"},
    {"input_text": "You are in a garden. There is a fountain to the north.", "target_text": "go north"},
    {"input_text": "You are in a dungeon. There is a locked door to the east.", "target_text": "unlock door"},
    {"input_text": "You are in a castle. There is a throne room to the west.", "target_text": "go west"},
    {"input_text": "You are in a laboratory. There is a strange device on the table.", "target_text": "examine device"},
    {"input_text": "You are in a desert. There is an oasis to the north.", "target_text": "go north"},
    {"input_text": "You are in a jungle. There is a river to the east.", "target_text": "go east"},
    {"input_text": "You are in a museum. There is an exhibit to the south.", "target_text": "go south"},
    {"input_text": "You are in a mine. There is a cart on the tracks.", "target_text": "ride cart"},
    {"input_text": "You are in a swamp. There is a path to the west.", "target_text": "go west"},
    {"input_text": "You are in a marketplace. There is a vendor selling potions.", "target_text": "buy potion"},
    {"input_text": "You are in a forest clearing. There is a campfire.", "target_text": "light fire"},
    {"input_text": "You are on a mountain trail. There is a cave entrance to the north.", "target_text": "enter cave"},
    {"input_text": "You are in a field. There is a barn to the east.", "target_text": "go east"},
    {"input_text": "You are in a canyon. There is a rope bridge to the south.", "target_text": "cross bridge"},
    {"input_text": "You are in a castle dungeon. There is a guard approaching.", "target_text": "hide"},
    {"input_text": "You are in an ancient ruin. There is a hidden passage to the west.", "target_text": "enter passage"},
    {"input_text": "You are in a wizard's tower. There is a spellbook on the table.", "target_text": "read spellbook"},
    {"input_text": "You are in a snowy tundra. There is a cave to the north.", "target_text": "enter cave"},
    {"input_text": "You are in a pirate ship. There is a treasure chest in the corner.", "target_text": "open chest"},
    {"input_text": "You are in a graveyard. There is a mausoleum to the east.", "target_text": "enter mausoleum"},
    {"input_text": "You are in a magical forest. There is a glowing tree to the south.", "target_text": "approach tree"},
    {"input_text": "You are in a fishing village. There is a pier to the west.", "target_text": "go to pier"},
    {"input_text": "You are in an enchanted garden. There is a statue in the center.", "target_text": "inspect statue"},
    {"input_text": "You are in a royal court. The king is on his throne.", "target_text": "speak to king"},
    {"input_text": "You are in a lighthouse. There is a spiral staircase.", "target_text": "climb stairs"},
    {"input_text": "You are in a carnival. There is a ferris wheel.", "target_text": "ride ferris wheel"},
    {"input_text": "You are in a marketplace. There is a blacksmith.", "target_text": "talk to blacksmith"},
    {"input_text": "You are in a fortress. There is a lookout tower.", "target_text": "climb tower"},
    {"input_text": "You are in a bakery. There is a loaf of bread on the counter.", "target_text": "take bread"},
    {"input_text": "You are in a hospital. There is a patient room to the north.", "target_text": "enter room"},
    {"input_text": "You are in a train station. There is a train about to depart.", "target_text": "board train"},
    {"input_text": "You are in a temple. There is an altar to the east.", "target_text": "approach altar"},
    {"input_text": "You are in a laboratory. There is a computer terminal.", "target_text": "use computer"},
    {"input_text": "You are in a castle courtyard. There is a fountain.", "target_text": "inspect fountain"},
    {"input_text": "You are in a spaceship. There is an airlock.", "target_text": "open airlock"},
    {"input_text": "You are in a dark alley. There is a ladder.", "target_text": "climb ladder"},
    {"input_text": "You are in a forest. There is a river.", "target_text": "follow river"},
    {"input_text": "You are in a village. There is a blacksmith shop.", "target_text": "enter shop"},
    {"input_text": "You are in a castle. There is a grand hall.", "target_text": "enter hall"},
    {"input_text": "You are in a dungeon. There is a locked chest.", "target_text": "unlock chest"},
    {"input_text": "You are in a library. There is an old book.", "target_text": "take book"},
    {"input_text": "You are in a forest. There is a mysterious hut.", "target_text": "enter hut"},
    {"input_text": "You are in a desert. There is a sandstorm.", "target_text": "find shelter"},
    {"input_text": "You are on a moon base. There is a rover to the east.", "target_text": "go east"},
    {"input_text": "You are in a medieval village. There is a blacksmith to the north.", "target_text": "go north"},
    {"input_text": "You are in a laboratory. There is a strange potion on the table.", "target_text": "drink potion"},
    {"input_text": "You are on a battlefield. There is a sword on the ground.", "target_text": "pick up sword"},
    {"input_text": "You are in a jungle. There is a treehouse above you.", "target_text": "climb treehouse"},
    {"input_text": "You are in a zoo. There is a lion in a cage to the west.", "target_text": "go west"},
    {"input_text": "You are in a cavern. There is a narrow passage to the south.", "target_text": "go south"},
    {"input_text": "You are in an ancient temple. There is an artifact on the altar.", "target_text": "take artifact"},
    {"input_text": "You are on a pirate ship. There is a plank leading overboard.", "target_text": "walk the plank"},
    {"input_text": "You are in a mystical forest. There is a unicorn to the east.", "target_text": "approach unicorn"},
    {"input_text": "You are in a wizard's lab. There is a wand on the table.", "target_text": "take wand"},
    {"input_text": "You are on a spaceship. There is an alien to the north.", "target_text": "talk to alien"},
    {"input_text": "You are in a haunted forest. There is a ghost to the south.", "target_text": "run away"},
    {"input_text": "You are in a magic shop. There is a crystal ball to the west.", "target_text": "look into ball"},
    {"input_text": "You are in a medieval castle. There is a banquet hall to the north.", "target_text": "enter hall"},
    {"input_text": "You are in a mysterious cave. There is an ancient drawing on the wall.", "target_text": "inspect drawing"},
    {"input_text": "You are on a deserted island. There is a signal fire to the west.", "target_text": "light signal fire"},
    {"input_text": "You are in a dark forest. There is a hidden trapdoor.", "target_text": "open trapdoor"},
    {"input_text": "You are in a cyberpunk city. There is a neon sign flashing to the east.", "target_text": "follow sign"},
    {"input_text": "You are in a snowy mountain. There is an avalanche coming.", "target_text": "take cover"},
    {"input_text": "You are in a medieval tavern. There is a bard singing.", "target_text": "listen to bard"},
    {"input_text": "You are on a riverbank. There is a boat tied to the dock.", "target_text": "untie boat"},
    {"input_text": "You are in a space station. There is a malfunction alarm.", "target_text": "investigate alarm"},
    {"input_text": "You are in a haunted mansion. There is a creaky door.", "target_text": "open door"},
    {"input_text": "You are in an alien jungle. There is a glowing plant.", "target_text": "touch plant"},
    {"input_text": "You are in a secret lab. There is a blueprint on the table.", "target_text": "study blueprint"},
    {"input_text": "You are on a flying carpet. There is a mountain ahead.", "target_text": "steer left"},
    {"input_text": "You are in a deep ocean. There is a sunken ship.", "target_text": "explore ship"},
    {"input_text": "You are in a time machine. There is a lever to the right.", "target_text": "pull lever"},
    {"input_text": "You are in an underground bunker. There is a radio.", "target_text": "turn on radio"},
    {"input_text": "You are in a mystical glade. There is a singing bird.", "target_text": "listen to bird"},
    {"input_text": "You are on a snowy path. There is a warm cabin ahead.", "target_text": "enter cabin"},
    {"input_text": "You are in a robotics lab. There is a robot assistant.", "target_text": "activate robot"},
    {"input_text": "You are on a starship. There is a black hole ahead.", "target_text": "change course"},
    {"input_text": "You are in an enchanted forest. There is a fairy to the north.", "target_text": "talk to fairy"},
    {"input_text": "You are in a dungeon. There is a dragon guarding the exit.", "target_text": "fight dragon"},
    {"input_text": "You are in a science lab. There is a chemical spill.", "target_text": "clean spill"},
    {"input_text": "You are in a bakery. There is a cake on the counter.", "target_text": "eat cake"},
    {"input_text": "You are on a mountain. There is a trail leading down.", "target_text": "follow trail"},
    {"input_text": "You are in a dark forest. There is a clearing to the east.", "target_text": "go east"},
    {"input_text": "You are in a spaceship. There is an escape pod to the north.", "target_text": "enter pod"},
    {"input_text": "You are in a medieval town. There is a market to the south.", "target_text": "go south"},
    {"input_text": "You are in a magical forest. There is a talking tree to the west.", "target_text": "listen to tree"},
    {"input_text": "You are in a cave. There is a hidden door to the east.", "target_text": "open door"},
    {"input_text": "You are in a castle. There is a knight to the north.", "target_text": "talk to knight"},
    {"input_text": "You are on a spaceship. There is a starlit sky outside.", "target_text": "look outside"},
    {"input_text": "You are in a forest. There is a deer to the west.", "target_text": "follow deer"},
    {"input_text": "You are in a village. There is a well in the center.", "target_text": "draw water"},
    {"input_text": "You are in a desert. There is a mirage to the north.", "target_text": "investigate mirage"},
    {"input_text": "You are on a beach. There is a seashell to the south.", "target_text": "pick up shell"},
    {"input_text": "You are in a library. There is a dusty book to the west.", "target_text": "open book"},
    {"input_text": "You are in a forest. There is a path to the north.", "target_text": "take path"},
    {"input_text": "You are on a mountain. There is a cave to the east.", "target_text": "enter cave"},
    {"input_text": "You are in a town square. There is a fountain in the center.", "target_text": "sit by fountain"},
    {"input_text": "You are on a pirate ship. There is a parrot to the north.", "target_text": "talk to parrot"},
    {"input_text": "You are in a castle. There is a secret passage to the south.", "target_text": "enter passage"},
    {"input_text": "You are in a spaceship. There is a warp drive to the east.", "target_text": "activate warp drive"},
    {"input_text": "You are in a jungle. There is a waterfall to the west.", "target_text": "approach waterfall"},
    {"input_text": "You are in a dark room. There is a candle on the table.", "target_text": "light candle"},
    {"input_text": "You are in a forest. There is a campfire to the south.", "target_text": "sit by campfire"},
    {"input_text": "You are in a market. There is a fruit stand to the north.", "target_text": "buy fruit"},
    {"input_text": "You are in a wizard's tower. There is a spellbook to the west.", "target_text": "read spellbook"},
    {"input_text": "You are on a beach. There is a surfboard to the east.", "target_text": "take surfboard"},
    {"input_text": "You are in a village. There is a festival to the south.", "target_text": "join festival"}
]

